let handler = async (m, { conn }) => {
  let name = conn.getName(m.sender);
  let teks = `
  ${pickRandom([
    'سبحان الله وبحمده سبحان الله العظيم', 
    //https://whatsapp.com/channel/0029VaJWgziC6ZvfdIpx5922
    // الكود هدية من إبـن_اليمــن🇾🇪
    'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ', 
    'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ', 
    'الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد',
    'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ',
    'أستغفر الله',
    'سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ',
    'الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ',
    'لَا إِلَهَ إِلَّا اللَّهُ',
    'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ',
    'سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ',
    'لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ',
    'اللهمّ إنّي أسْتغفرك من كلّ ذنبٍ وأتوبُ إليك',
    'اللَّهُمَّ اغْفِرْ لي ذَنْبِي كُلَّهُ دِقَّهُ، وجِلَّهُ، وأَوَّلَهُ وآخِرَهُ وعَلانِيَتَهُ وسِرَّهُ',
  ])}
  `.trim();
  conn.reply(m.chat, teks, m, { mentions: { mentionedJid: [m.sender] } });
};

handler.customPrefix = /تسبيح/i;
handler.command = new RegExp;

export default handler;

function pickRandom(list) {
  return list[Math.floor(Math.random() * list.length)];
}
