let handler = async m => m.reply(`

≡  𝚁𝙰𝙶𝙽𝙰𝚁 𒉭 𝙼𝙰𝚂𝚃𝙴𝚁

> 𝗧𝗘𝗖𝗛𝗡𝗜𝗖𝗔𝗟 𝗦𝗨𝗣𝗣𝗢𝗥𝗧:
─────────────
▢ *𝗥𝗔𝗚𝗡𝗔𝗥_𝗖𝗢𝗗𝗘*
> https://wa.me/+252686543993?text=السلام+عليكم+ورحمة+الله+وبركاتة+كيفك+يا+مطور+راغنر🕸️
─────────────
▢ *𝗦𝗨𝗣𝗣𝗢𝗥𝗧_𝗚𝗥𝗢𝗨𝗣_(𝗔𝗥🇸🇦)*
> https://whatsapp.com/channel/0029VafG0N8I1rclRCFLaL0g
───────────── 
▢ *𝗥𝗔𝗚𝗡𝗔𝗥_𝗥𝗘𝗟𝗜𝗚𝗜𝗢𝗡_(𝗥𝗘𝗟𝗡🕋)*
> https://whatsapp.com/channel/0029VaobATOJ93wRumZwCJ3i
`.trim())
handler.help = ['gpflash']
handler.tags = ['main']
handler.command = ['group', 'support','الدعم','دعم']

export default handler
